"""В этом файле находятся все кэффициенты по расчету материалов 
для для узлов прохода через стену и сопутствующей арматуры для
труб в ППУ - изоляции"""
from rest_framework.response import Response
import json

class Materials():
    def __init__(self, serializer):

        self.spec = {}

        self.json_str = str()

        #Переменные для полного названия в спецификацию
        self.mat_name = str()
        self.mat_gost = str()
        self.mat_izm = str()
        self.mat_kol = str()

        #Запас по ВСЕМ строительны материалам
        self.zap = 1.1

        for key, value in serializer.data.items():

            #Переменные для стальных труб в ППУ - изоляции
            if key == "diameter_PPU":
                self.diameter_PPU = value
            elif key == "vvoda_PPU":
                self.vvoda_PPU = value
            elif key == "nopora_PPU":
                self.nopora_PPU = value

            #Переменные для труб типа "Изопрофлекс"
            elif key == "diameter_IZOP":
                self.diameter_IZOP = value
            elif key == "vvoda_IZOP":
                self.vvoda_IZOP = value
            elif key == "nopora_IZOP":
                self.nopora_IZOP = value

            #Переменные для расчета строительной части канала
            elif key == "width_mon":
                self.width_mon = value
            elif key == "height_mon":
                self.height_mon = value
            elif key == "m_mon":
                self.m_mon = value
            elif key == "width_bez_1":
                self.width_bez_1 = value
            elif key == "m_bez_1":
                self.m_bez_1 = value
            elif key == "width_bez_2":
                self.width_bez_2 = value
            elif key == "m_bez_2":
                self.m_bez_2 = value                
            elif key == "l6_sht":
                self.l6_sht = value
            elif key == "l11_sht":
                self.l11_sht = value
            elif key == "podb_B15":
                self.podb_B15 = value
            elif key == "sil_PPU":
                self.sil_PPU = value
            elif key == "sil_IZOP":
                self.sil_IZOP = value

            #Переменные для учета сборных ж/б конструкций
            elif key == "l6_l":
                self.l6_l = value
            elif key == "l6_dl":
                self.l6_dl = value
            elif key == "l6_pl":
                self.l6_pl = value
            elif key == "l6_dpl":
                self.l6_dpl = value
            elif key == "l11_l":
                self.l11_l = value
            elif key == "l11_dl":
                self.l11_dl = value
            elif key == "l11_pl":
                self.l11_pl = value                
            elif key == "l11_dpl":
                self.l11_dpl = value
            elif key == "fbs336":
                self.fbs336 = value
            elif key == "fbs636":
                self.fbs636 = value
            elif key == "fbs936":
                self.fbs936 = value
            elif key == "fbs1236":
                self.fbs1236 = value
            elif key == "fbs2436":
                self.fbs2436 = value
    
    def description(self):
        if self.mat_gost == None:
            self.spec[str(self.name)] = {'mat_name': str(self.mat_name), 'mat_izm': str(self.mat_izm), 'mat_kol': str(self.mat_kol)}
        else:
            self.spec[str(self.name)] = {'mat_name': str(self.mat_name), 'mat_gost': str(self.mat_gost), 'mat_izm': str(self.mat_izm), 'mat_kol': str(self.mat_kol)}

#В словарях ниже представлены коэффициенты для расчета строительных материалов на ввода в здания для стальных труб в ППУ - изоляции

futlar_PPU = {
    50 : '219x6' , 
    65 : '273x7' ,
    80 : '273x7' ,
    100 : '325x7' ,
    125 : '325x7' ,
    150 : '426x7' ,
    200 : '426x7' ,
    250 : '530x8' ,
    300 : '630x8' ,
    400 : '720x9' ,
    500 : '820x10',
}

vilaterm_PPU = {
    50 : '5.6'  ,
    65 : '6.1'  ,
    80 : '10.1' ,
    100 : '12.6' ,
    125 : '14.1' ,
    150 : '15.7' ,
    200 : '19.8' ,
    250 : '25.1' ,
    300 : '28.3' ,
    400 : '35.2' ,
    500 : '44.6' ,
}

beton_PPU = {
    50 : '0.04' ,
    65 : '0.05' ,
    80 : '0.05' ,
    100 : '0.08' ,
    125 : '0.08' ,
    150 : '0.08' ,
    200 : '0.08' ,
    250 : '0.11' ,
    300 : '0.14' ,
    400 : '0.18' ,
    500 : '0.22' ,
}

kanat_PPU = {
    50 : '2.80' ,
    65 : '3.10' ,
    80 : '3.10' ,
    100 : '3.10' ,
    125 : '3.10' ,
    150 : '3.10' ,
    200 : '3.10' ,
    250 : '3.10' ,
    300 : '3.10' ,
    400 : '3.10' ,
    500 : '3.10' ,
}

bitum_PPU = {
    50 : '0.42' ,
    65 : '0.44' ,
    80 : '0.46' ,
    100 : '0.53' ,
    125 : '0.58' ,
    150 : '0.60' ,
    200 : '0.62' ,
    250 : '0.64' ,
    300 : '0.65' ,
    400 : '0.68' ,
    500 : '0.68' ,
}

n_opora_PPU = {
    50 : 'ТС-660.00.00-03' ,
    65 : 'ТС-660.00.00-04' ,
    80 : 'ТС-660.00.00-05' ,
    100 : 'ТС-660.00.00-06' ,
    125 : 'ТС-660.00.00-07' ,
    150 : 'ТС-660.00.00-08' ,
    200 : 'ТС-660.00.00-09' ,
    250 : 'ТС-660.00.00-10' ,
    300 : 'ТС-660.00.00-11' ,
    400 : 'ТС-660.00.00-13' ,
    500 : 'ТС-660.00.00-14' ,
}

#В словарях ниже представлены коэффициенты для расчета стальных труб сответственно стальных труб в ППУ - изоляции

stal_dn_PPU = {
    50 : '57' , 
    65 : '76' ,
    80 : '89' ,
    100 : '108',
    125 : '133',
    150 : '159',
    200 : '219',
    250 : '273',
    300 : '325',
    400 : '426',
    500 : '530',
}

stal_h_PPU = {
    50 : '4' , 
    65 : '4' ,
    80 : '5' ,
    100 : '5' ,
    125 : '5' ,
    150 : '5' ,
    200 : '6' ,
    250 : '7' ,
    300 : '8' ,
    400 : '8' ,
    500 : '8' ,
}

stal_ves_PPU = {
    50 : '5.2'  , 
    65 : '7.1'  ,
    80 : '10.4' ,
    100 : '12.7' ,
    125 : '15.8' ,
    150 : '19.0' ,
    200 : '31.5' ,
    250 : '45.9' ,
    300 : '62.5' ,
    400 : '82.5' ,
    500 : '103.0',
}

stal_otvod_h_PPU = {
    50 : '5' , 
    65 : '5' ,
    80 : '6' ,
    100 : '6' ,
    125 : '6' ,
    150 : '7' ,
    200 : '8' ,
    250 : '9' ,
    300 : '9' ,
    400 : '9' ,
    500 : '10',
}

#В словарях ниже представлены коэффициенты для расчета спускников для стальных труб в ППУ - изоляции

spusk_kran_PPU = {
    50 : '40' , 
    65 : '40' ,
    80 : '40' ,
    100 : '40' ,
    125 : '40' ,
    150 : '50' ,
    200 : '80' ,
    250 : '80' ,
    300 : '100',
    400 : '100',
    500 : '150',
}

spusk_ves_PPU = {
    50 : '4.1' , 
    65 : '4.1' ,
    80 : '4.1' ,
    100 : '4.1' ,
    125 : '4.1' ,
    150 : '5.2' ,
    200 : '10.4',
    250 : '10.4',
    300 : '12.7',
    400 : '12.7',
    500 : '24.0',
}

spusk_h_trub_PPU = {
    50 : '4' , 
    65 : '4' ,
    80 : '4' ,
    100 : '4' ,
    125 : '4' ,
    150 : '4' ,
    200 : '5' ,
    250 : '5' ,
    300 : '5' ,
    400 : '5' ,
    500 : '5' ,
}

spusk_dn_PPU = {
    50 : '45' , 
    65 : '45' ,
    80 : '45' ,
    100 : '45' ,
    125 : '45' ,
    150 : '57' ,
    200 : '89' ,
    250 : '89' ,
    300 : '108',
    400 : '108',
    500 : '168',
}

#В словарях ниже представлены коэффициенты для расчета воздушников для стальных труб в ППУ - изоляции

vozd_kran_PPU = {
    50 : '32' , 
    65 : '32' ,
    80 : '32' ,
    100 : '32' ,
    125 : '32' ,
    150 : '32' ,
    200 : '32' ,
    250 : '32' ,
    300 : '32' ,
    400 : '32' ,
    500 : '40' ,
}

vozd_ves_PPU = {
    50 : '2.6' , 
    65 : '2.6' ,
    80 : '2.6' ,
    100 : '2.6' ,
    125 : '2.6' ,
    150 : '2.6' ,
    200 : '2.6' ,
    250 : '2.6' ,
    300 : '2.6' ,
    400 : '2.6' ,
    500 : '4.1' ,
}

vozd_h_trub_PPU = {
    50 : '3' , 
    65 : '3' ,
    80 : '3' ,
    100 : '3' ,
    125 : '3' ,
    150 : '3' ,
    200 : '3' ,
    250 : '3' ,
    300 : '3' ,
    400 : '3' ,
    500 : '4' ,
}

vozd_dn_PPU = {
    50 : '38' , 
    65 : '38' ,
    80 : '38' ,
    100 : '38' ,
    125 : '38' ,
    150 : '38' ,
    200 : '38' ,
    250 : '38' ,
    300 : '38' ,
    400 : '38' ,
    500 : '45' ,
}

#В словарях ниже представлены коэффициенты для расчета строительных материалов на ввода в здания для труб типа "Изопрофлекс"

futlar_IZOP = {
  25 : '133x5' ,
  32 : '133x5' ,
  40 : '159x5' ,
  50 : '219x6' ,
  63 : '219x6' ,
  75 : '219x6' ,
  90 : '273x7' ,
  110 : '273x7' ,
  125 : '325x7' ,
  140 : '325x7' ,
  160 : '325x7' ,     
}

beton_IZOP = {
  25 : '1.00' ,
  32 : '1.00' ,
  40 : '1.00' ,
  50 : '1.00' ,
  63 : '1.00' ,
  75 : '1.00' ,
  90 : '1.00' ,
  110 : '1.00' ,
  125 : '1.00' ,
  140 : '1.00' ,
  160 : '1.00' ,     
}

m100_IZOP = {
  25 : '0.50' ,
  32 : '0.50' ,
  40 : '0.50' ,
  50 : '0.50' ,
  63 : '0.50' ,
  75 : '0.50' ,
  90 : '0.50' ,
  110 : '0.50' ,
  125 : '0.50' ,
  140 : '0.50' ,
  160 : '0.50' ,     
}

vilaterm_IZOP = {
  25 : '25.00' ,
  32 : '25.00' ,
  40 : '25.00' ,
  50 : '25.00' ,
  63 : '25.00' ,
  75 : '25.00' ,
  90 : '25.00' ,
  110 : '25.00' ,
  125 : '25.00' ,
  140 : '25.00' ,
  160 : '25.00' ,     
}

bitum_IZOP = {
  25 : '15' ,
  32 : '15' ,
  40 : '15' ,
  50 : '15' ,
  63 : '15' ,
  75 : '15' ,
  90 : '15' ,
  110 : '15' ,
  125 : '15' ,
  140 : '15' ,
  160 : '15' ,     
}

n_opora_IZOP = {
  25 : 'ТС-659.00.00-00' ,
  32 : 'ТС-659.00.00-00' ,
  40 : 'ТС-659.00.00-02' ,
  50 : 'ТС-659.00.00-02' ,
  63 : 'ТС-659.00.00-03' ,
  75 : 'ТС-659.00.00-04' ,
  90 : 'ТС-659.00.00-05' ,
  110 : 'ТС-659.00.00-06' ,
  125 : 'ТС-659.00.00-06' ,
  140 : 'ТС-659.00.00-07' ,
  160 : 'ТС-659.00.00-08' ,     
}

stal_du_IZOP = {
  25 : '20' ,
  32 : '25' ,
  40 : '32' ,
  50 : '40' ,
  63 : '50' ,
  75 : '65' ,
  90 : '80' ,
  110 : '100' ,
  125 : '100' ,
  140 : '125' ,
  160 : '150' ,  
}

#В словарях ниже представлены коэффициенты для расчета стальных труб соответственно труб типа "Изопрофлекс"

stal_dn_IZOP = {
  25 : '26' ,
  32 : '32' ,
  40 : '42' ,
  50 : '45' ,
  63 : '57' ,
  75 : '76' ,
  90 : '89' ,
  110 : '108' ,
  125 : '108' ,
  140 : '133' ,
  160 : '159' ,  
}

stal_h_IZOP = {
  25 : '3,2' ,
  32 : '4,0' ,
  40 : '4,0' ,
  50 : '4,0' ,
  63 : '4,5' ,
  75 : '4,5' ,
  90 : '4,5' ,
  110 : '5,0' ,
  125 : '5,0' ,
  140 : '5,5' ,
  160 : '5,5' ,     
}

stal_ves_IZOP = {
  25 : '1.86' ,
  32 : '2.91' ,
  40 : '3.78' ,
  50 : '4.34' ,
  63 : '6.16' ,
  75 : '7.88' ,
  90 : '9.32' ,
  110 : '13.44' ,
  125 : '13.44' ,
  140 : '18.24' ,
  160 : '21.63' ,      
}

stal_otvod_h_IZOP = {
  25 : '4,0' ,
  32 : '5,0' ,
  40 : '5,0' ,
  50 : '5,0' ,
  63 : '5,0' ,
  75 : '5,0' ,
  90 : '6,0' ,
  110 : '6,0' ,
  125 : '6,0' ,
  140 : '6,0' ,
  160 : '7,0' ,      
}

#В словарях ниже представлены коэффициенты для расчета спускников для стальных труб соответственно труб типа "Изопрофлекс"

spusk_kran_IZOP = {
    25 : '20' ,
    32 : '25' ,
    40 : '32' ,
    50 : '40' ,
    63 : '40' ,
    75 : '40' ,
    90 : '40' ,
    110 : '40' ,
    125 : '40' ,
    140 : '50' ,
    160 : '50' ,  
}

spusk_ves_IZOP = {
    25 : '1.80' ,
    32 : '2.76' ,
    40 : '3.74' ,
    50 : '4.04' ,
    63 : '4.04' ,
    75 : '4.04' ,
    90 : '4.04' ,
    110 : '4.04' ,
    125 : '4.04' ,
    140 : '5.23' ,
    160 : '5.23' ,  
}

spusk_h_trub_IZOP = {
    25 : '3' ,
    32 : '4' ,
    40 : '4' ,
    50 : '4' ,
    63 : '4' ,
    75 : '4' ,
    90 : '4' ,
    110 : '4' ,
    125 : '4' ,
    140 : '4' ,
    160 : '4' ,  
}

spusk_dn_IZOP = {
    25 : '26' ,
    32 : '32' ,
    40 : '42' ,
    50 : '45' ,
    63 : '45' ,
    75 : '45' ,
    90 : '45' ,
    110 : '45' ,
    125 : '45' ,
    140 : '57' ,
    160 : '57' ,  
}

#В словарях ниже представлены коэффициенты для расчета воздушников для стальных труб соответственно труб типа "Изопрофлекс"

vozd_kran_IZOP = {
    25 : '20' ,
    32 : '25' ,
    40 : '32' ,
    50 : '32' ,
    63 : '32' ,
    75 : '32' ,
    90 : '32' ,
    110 : '32' ,
    125 : '32' ,
    140 : '32' ,
    160 : '32' ,  
}

vozd_ves_IZOP = {
    25 : '1.80' ,
    32 : '2.15' ,
    40 : '2.60' ,
    50 : '2.60' ,
    63 : '2.60' ,
    75 : '2.60' ,
    90 : '2.60' ,
    110 : '2.60' ,
    125 : '2.60' ,
    140 : '2.60' ,
    160 : '2.60' ,  
}

vozd_h_trub_IZOP = {
    25 : '3' ,
    32 : '3' ,
    40 : '3' ,
    50 : '3' ,
    63 : '3' ,
    75 : '3' ,
    90 : '3' ,
    110 : '3' ,
    125 : '3' ,
    140 : '3' ,
    160 : '3' ,  
}

vozd_dn_IZOP = {
    25 : '26' ,
    32 : '32' ,
    40 : '38' ,
    50 : '38' ,
    63 : '38' ,
    75 : '38' ,
    90 : '38' ,
    110 : '38' ,
    125 : '38' ,
    140 : '38' ,
    160 : '38' ,  
}